# ABC037C - 総和
# URL: https://atcoder.jp/contests/abc037/tasks/abc037_c
# 日付: 2020/12/15

# ---------- 思ったこと / 気づいたこと ----------
#

# ------------------- 方針 --------------------
# ただの累積和

# ------------------- 解答 --------------------
#code:python
n, k = map(int, input().split())
a = list(map(int, input().split()))

import itertools
cum = [0] + list(itertools.accumulate(a))
ans = 0
for i in range(n-k+1):
    ans += (cum[i+k] - cum[i])
print(ans)

# ------------------ 入力例 -------------------
5 3
1 2 4 8 16

20 10
100000000 100000000 98667799 100000000 100000000 100000000 100000000 99986657 100000000 100000000 100000000 100000000 100000000 98995577 100000000 100000000 99999876 100000000 100000000 99999999

# ----------------- 解答時間 ------------------
# 8分

# -------------- 解説 / 感想 / 反省 -------------
# https://img.atcoder.jp/data/abc/037/editorial.pdf
# 昔の問題はこの程度で緑か！

# ----------------- カテゴリ ------------------
#AtCoder #abc
#累積和
