# ABC053C - X: Yet Another Die Game
# URL: https://atcoder.jp/contests/arc068/tasks/arc068_a
# 日付: 2020/12/22

# ---------- 思ったこと / 気づいたこと ----------
# 6と5だけ繰り返せばいいやん: 6+5=11を繰り返しまくる
# 11を何回繰り返せばxになるか？

# ------------------- 方針 --------------------
# 6以下なら1回
# 11以下なら2回
# 11以上なら何回11で割れるか計算して，残り何回か計算

# ------------------- 解答 --------------------
#code:python
x = int(input())
if x <= 6:
    print(1)
    exit()
elif 7 < x <= 11:
    print(2)
    exit()
else:
    n = x//11
    if x - n*11 == 0:
        print(2*n)
        exit()
    elif x - n*11 <= 6:
        print(2*n+1)
    else:
        print(2*n+2)


# ------------------ 入力例 -------------------
7

149696127901

# ----------------- 解答時間 ------------------
# 10分

# -------------- 解説 / 感想 / 反省 -------------
# https://img.atcoder.jp/arc068/editorial.pdf
# 簡単な四則演算で求められますとだけ書かれててわろた

# ----------------- カテゴリ ------------------
#AtCoder #abc
#O(1)
