# ABC093C - Same Integers
# URL: https://atcoder.jp/contests/abc093/tasks/arc094_a
# 日付: 2020/11/26


# ---------- 思ったこと / 気づいたこと ----------
#

# ------------------- 方針 --------------------
# 現在の3つの数字をリストで持つ
# 3つ異なる時 -> 小さい2つに1を足す
# 1つ小さく，2つ同じ大きいのとき (3, 5, 5) -> 小さい1つに2を足す
# 1つ大きい，2つ小さいとき (6,5,5) -> 小さい2つに1を足す


# ------------------- 解答 --------------------
code:python
    x=list(map(int, input().split()))
    ans = 0
    while True:
        x.sort()
        if x[0] == x[1] == x[2]:
            break
        if x[0] != x[1] and x[0] != x[2] and x[2] != x[1]:
            ans += 1
            x[0] += 1
            x[1] += 1
        elif x[0] < x[1] and x[0] < x[2] and x[1] == x[2]:
            ans += 1
            x[0] += 2
        elif x[0] < x[2] and x[1] < x[2] and x[0] == x[1]:
            ans += 1
            x[0] += 1
            x[1] += 1
    print(ans)

# ------------------ 入力例 -------------------
2 5 4

2 6 3

# ----------------- 解答時間 ------------------
# 10分

# -------------- 解説 / 感想 / 反省 -------------
# https://img.atcoder.jp/arc094/editorial.pdf
# 超短い解答ある: https://atcoder.jp/contests/abc093/submissions/2484173
# 最初代数的に解こうかと思ったけど無理そうだったからやめ

# ----------------- カテゴリ ------------------
#AtCoder #abc-c
