# ABC177-C: Sum of product of pair
# URL:
# 日付: 2020/11/18

# ---------- 思ったこと / 気づいたこと ----------
# 左右対称な表の右上だけ求めればいいので，全体から引けばいい

# ------------------- 方針 --------------------
# 全体 = Aの和の2乗
# 対角成分: a^2の和なのでO(N)で求められる
# (全体-対角成分)//2が欲しい答え

# ------------------- 解答 --------------------
#code:python
mod = 10**9+7
n = int(input())
a = list(map(int, input().split()))

now = sum(a)**2
sq = 0
for i in a:
    sq += i**2

print((now-sq)//2 % mod)

# ------------------ 入力例 -------------------


# ----------------- 解答時間 ------------------
# 16分

# ---------------- 感想 / 反省 ----------------
# 勢いでmod忘れててWA
# 考察が上手く行ってよかった

# ----------------- カテゴリ ------------------
#AtCoder #abc-c
#数学