# ABC120C - Unification
# URL: https://atcoder.jp/contests/abc120/tasks/abc120_c
# 日付: 2020/11/26

# ---------- 思ったこと / 気づいたこと ----------
# 同じ問題みたことある！！！これ！！！
# https://atcoder.jp/contests/arc108/tasks/arc108_b

# ------------------- 方針 --------------------
# tという空の文字列に，sの先頭からappendしていく。
# tのケツ2文字が01 or 10なら消す

# ------------------- 解答 --------------------
code:python
    s = input()
    s = [int(i) for i in s]
    t = []

    for i in range(len(s)):
        t.append(s[i])
        if len(t) >= 2:
            if [t[-1], t[-2]] == [1, 0] or [t[-1], t[-2]] == [0, 1]:
                t.pop()
                t.pop()
    print(len(s)-len(t))
# ------------------ 入力例 -------------------

11011010001011


# ----------------- 解答時間 ------------------
# 5分

# -------------- 解説 / 感想 / 反省 -------------
# 類題をといた事あったおかげで解けた
# 普通にs.replace('01', '')で処理するとTLEになる

# ----------------- カテゴリ ------------------
#AtCoder #abc
#文字列
