# ABC163C - management
# URL: https://atcoder.jp/contests/abc163/tasks/abc163_c
# 日付: 2020/11/22

# ---------- 思ったこと / 気づいたこと ----------
# 日本語紛らわしいけどO(N)のループを回せばいい

# ------------------- 方針 --------------------
# 各iに対する部下の人数リストを作って，incrementしていく


# ------------------- 解答 --------------------
#code:python
n = int(input())
a = list(map(int, input().split()))

buka = [0]*n
for i in a:
    buka[i-1] += 1

for i in buka:
    print(i)

# ------------------ 入力例 -------------------
5
1 1 2 2

10
1 1 1 1 1 1 1 1 1

# ----------------- 解答時間 ------------------
# 7分

# -------------- 解説 / 感想 / 反省 -------------
# https://img.atcoder.jp/abc163/editorial.pdf

# ----------------- カテゴリ ------------------
#AtCoder #abc
#flagを上手く使う
