# ABC186C - 
# URL: https://atcoder.jp/contests/abc186/tasks/abc186_c
# 日付: 2020/12/19

# ---------- 思ったこと / 気づいたこと ----------
#

# ------------------- 方針 --------------------
#

# ------------------- 解答 --------------------
#code:python
n = int(input())
ans = 0
for i in range(1, n+1):
    if (not '7' in str(i)) and (not '7' in oct(i)):
        ans += 1
print(ans)
# ------------------ 入力例 -------------------
20

100000

# ----------------- 解答時間 ------------------
#

# -------------- 解説 / 感想 / 反省 -------------
#

# ----------------- カテゴリ ------------------
#AtCoder #abc
#解説AC #復習したい
