# ABC186B -
# URL: https://atcoder.jp/contests/abc186/tasks/abc186_b
# 日付: 2020/12/19

# ---------- 思ったこと / 気づいたこと ----------
#

# ------------------- 方針 --------------------
#

# ------------------- 解答 --------------------
#code:python
h, w = map(int, input().split())
import numpy as np
G = [[int(i) for i in input().split()] for _ in range(h)]
G = np.array(G)
min_G = G.min()
print((G-min_G).sum())

# ------------------ 入力例 -------------------
2 3
2 2 3
3 2 2

3 3
99 99 99
99 0 99
99 99 99

# ----------------- 解答時間 ------------------
#

# -------------- 解説 / 感想 / 反省 -------------
#

# ----------------- カテゴリ ------------------
#AtCoder #abc
#解説AC #復習したい
