# ABC186D - 
# URL: https://atcoder.jp/contests/abc186/tasks/abc186_d
# 日付: 2020/12/19

# ---------- 思ったこと / 気づいたこと ----------
# 絶対値がやっかいだし，大変そう
# 赤坂にソートしてもOKと言われるまで気づかなかった

# ------------------- 方針 --------------------
# 全ての要素の総当りの組み合わせなので，ソートしても大丈夫
# 降順にソートして，絶対値の影響がないようにする
# 累積和

# ------------------- 解答 --------------------
#code:python
n = int(input())
A = list(map(int, input().split()))

A = sorted(A, reverse=True)
from itertools import accumulate
cum = [0] + list(accumulate(A))

ans = 0
for i in range(1, n):
    ans += A[i-1] * (n-i) - (cum[n]-cum[i])
print(ans)



# ------------------ 入力例 -------------------
4
3 4 2 6

5
31 41 59 26 53

3
5 1 2


# ----------------- 解答時間 ------------------
#

# -------------- 解説 / 感想 / 反省 -------------
#

# ----------------- カテゴリ ------------------
#AtCoder #abc
#累積和
