# Educational DP Contest: U - Grouping
# URL: https://atcoder.jp/contests/dp/tasks/dp_u
# 日付: 2020/12/27

# ---------- 思ったこと / 気づいたこと ----------
# bit DPらしい

# ------------------- 方針 --------------------
# S: うさぎの部分集合
# dp[S]: 部分集合Sに属する全てのうさぎをマッチング済みとしたときの，得点の最大値

# ------------------- 解答 --------------------
#code:python


# ------------------ 入力例 -------------------


# ----------------- 解答時間 ------------------
#

# -------------- 解説 / 感想 / 反省 -------------
#

# ----------------- カテゴリ ------------------
#EDPC
#動的計画法
#DP
#解説AC #復習したい