# ABC139D - ModSum
# Bootcamp For Beginners - Medium
# URL: https://atcoder.jp/contests/abc139/tasks/abc139_d
# 日付: 2020/12/28

# ---------- 思ったこと / 気づいたこと ----------
# N<=10**9なのでO(1)で解く

# ------------------- 方針 --------------------
# iをi+1で割れば余りはiになる
# (1 mod 2) + (2 mod 3) + ... + ((N − 1) mod N) + (N mod 1) = 1 + 2 + ... + N − 1 = N(N − 1)//2

# ------------------- 解答 --------------------
#code:python
n = int(input())
print(n*(n-1)//2)

# ------------------ 入力例 -------------------
13


# ----------------- 解答時間 ------------------
# 12分

# -------------- 解説 / 感想 / 反省 -------------
# https://img.atcoder.jp/abc139/editorial.pdf
# どうやったら最大になるのか色々手動かしてたら時間かかった

# ----------------- カテゴリ ------------------
#AtCoder
#BootcampForBeginners-medium
#ABC-D