# ARC112B
# URL:
# Date: 2021/02/13

# ---------- Ideas ----------
# Bが正のとき
# a1: 作れる最小値: - (B + C//2)
# a2: 作れる最大値: B + (C//2-1)
# a3: 作れる正の最小値: B - C//2
# a4: 作れる負の最大値: -B + C//3

# Bが負のとき
# a1: 作れる負の最小値: B - C//2
# a2: 作れる正の最大値: -B + (C-1)//2
# a3: 作れる負の最大値: B + (C-1)//2
# a4: 作れる正の最小値: -B - (C-1)//2


# ------------------- Solution --------------------
#



# ------------------- Answer --------------------
#code:python
B, C = map(int, input().split())
if B >= 0:
    a1 = - (B + C//2)
    a2 = B + (C//2-1)
    a3 = max(B - C//2, 0)
    a4 = min(-B + C//3, 0)
    print(a4 - a1 + 1 + a2 - a3)
else:
    a1 = B - C//2
    a2 = -B + (C-1)//2
    a3 = max(B + (C-1)//2, 0)
    a4 = max(-B - C//2, 0)
    print(a3-a1+1 + a2-a4)


# ------------------ Sample Input -------------------
11 2

0 4

112 20210213

-211 1000000000000000000


# ----------------- Length of time ------------------
#

# -------------- Editorial / my impression -------------
#

# ----------------- Category ------------------
#AtCoder
#AC_with_editorial #解説AC
#wanna_review #hard復習 #復習したい
