# キーエンス プログラミング コンテスト 2021 A:
# URL: https://atcoder.jp/contests/keyence2021/tasks/keyence2021_a
# Date: 2021/01/16

# ---------- Ideas ----------
# aとbに関して，現在まで最大値を持っておく
# cのmaxを所持

# ------------------- Solution --------------------
# aはi番目までの

# ------------------- Answer --------------------
#code:python
n = int(input())
a = list(map(int, input().split()))
b = list(map(int, input().split()))

a_max = a[0]
c_max = a[0]*b[0]

for i in range(n):
    a_max = max(a_max, a[i])
    c_max = max(c_max, a_max*b[i])
    print(c_max)





# ------------------ Sample Input -------------------
3
3 2 20
1 4 1

20
715806713 926832846 890153850 433619693 890169631 501757984 778692206 816865414 50442173 522507343 546693304 851035714 299040991 474850872 133255173 905287070 763360978 327459319 193289538 140803416
974365976 488724815 821047998 371238977 256373343 218153590 546189624 322430037 131351929 768434809 253508808 935670831 251537597 834352123 337485668 272645651 61421502 439773410 621070911 578006919


# ----------------- Length of time ------------------
#

# -------------- Editorial / my impression -------------
#

# ----------------- Category ------------------
#AtCoder
#キーエンスプログラミングコンテスト2021
#300点問題
#AC_with_editorial #解説AC
#wanna_review #hard復習 #復習したい
