# ABC040C - 柱柱柱柱柱
# URL: https://atcoder.jp/contests/abc040/tasks/abc040_c
# 日付: 2020/12/11

# ---------- 思ったこと / 気づいたこと ----------
# DPやん

# ------------------- 方針 --------------------
# 1つ前までのコスト＋1つ前から現在までのコスト or  2つ前までのコスト＋2つ前から現在までのコスト
# これで更新していく

# ------------------- 解答 --------------------
#code:python
n = int(input())
a = list(map(int, input().split()))

inf = float('INF')
dp = [inf]*n
dp[0] = 0
dp[1] = abs(a[1]- a[0])

for i in range(2, n):
    dp[i] = min(dp[i-1] + abs(a[i] - a[i-1]),
                dp[i-2] + abs(a[i] - a[i-2]))
print(dp[n-1])

# ------------------ 入力例 -------------------
4
100 150 130 120

4
100 125 80 110

9
314 159 265 358 979 323 846 264 338


# ----------------- 解答時間 ------------------
# 7分

# -------------- 解説 / 感想 / 反省 -------------
# https://img.atcoder.jp/data/abc/040/editorial.pdf

# ----------------- カテゴリ ------------------
#AtCoder #abc
#動的計画法
#DP
