# ABC086C - Traveling
# URL: https://atcoder.jp/contests/abc086/tasks/arc089_a
# 日付: 2020/11/28

# ---------- 思ったこと / 気づいたこと ----------
# 入力が大きいので，クエリごとに処理したほうが良さそう

# ------------------- 方針 --------------------
# もし「前の地点との座標の差 > 時間差」なら行けない
# x+yの偶奇 = tの差の偶奇ならOK

# ------------------- 解答 --------------------
code:python
    n = int(input())
    t1, x1, y1 = 0, 0, 0
    flag = True
    for i in range(n):
    t2, x2, y2 = map(int, input().split())
    x = abs(x2 - x1)
    y = abs(y2 - y1)
    t = t2-t1
    if x + y <= t and (x + y) % 2 == t % 2:
        pass
    else:
        flag = False
    x1, y1, t1 = x2, y2, t2

    if flag: print('Yes')
    else: print('No')



# ------------------ 入力例 -------------------
2
3 1 2
6 1 1

1
2 100 100

2
5 1 1
100 1 1


# ----------------- 解答時間 ------------------
# 15分くらい?

# -------------- 解説 / 感想 / 反省 -------------
# 偶奇の処理する方法でOKなのか証明してないけどとりあえずやってみたらできた

# ----------------- カテゴリ ------------------
#AtCoder #abc
#偶奇に注目
