# ABC078C - HSI
# URL: https://atcoder.jp/contests/abc078/tasks/arc085_a
# 日付: 2020/12/16

# ---------- 思ったこと / 気づいたこと ----------
#

# ------------------- 方針 --------------------
# k回目で正解するときの期待値が表せるので，kを無限に飛ばして，roundする

# ------------------- 解答 --------------------
#code:python
n, m = map(int, input().split())
time = 1900*m+100*(n-m)

ans = 0
for k in range(1, 100000):
    ans += ((1-0.5**m))**(k-1) * (0.5**m) * time * k
print(round(ans))
# ------------------ 入力例 -------------------
1 1

10 2

100 5

# ----------------- 解答時間 ------------------
# 24分

# -------------- 解説 / 感想 / 反省 -------------
# https://img.atcoder.jp/arc085/editorial.pdf
# なんか回りくどいことやったきがする

# ----------------- カテゴリ ------------------
#AtCoder #abc
#期待値
#確率