# ABC006C - スフィンクスのなぞなぞ
# URL: https://atcoder.jp/contests/abc006/tasks/abc006_3
# 日付: 2020/12/14


# ---------- 思ったこと / 気づいたこと ----------
#

# ------------------- 方針 --------------------
# 未知数3つで連立方程式が2つあるので，一意に定まらないのは文字1つ
# N,=10**5なので，大人の人数aを全探索すればいい
# a,b,cともに負でなければ成立

# ------------------- 解答 --------------------
#code:python
n, m = map(int, input().split())
for a in range(10**5+1):
    b = 4*n-m-2*a
    c = n-a-b
    if a >= 0 and b >= 0 and c >= 0:
        if a+b+c != 0:
            print(a, b, c)
            exit()
print(-1, -1, -1)


# ------------------ 入力例 -------------------
3 9
7 23

# ----------------- 解答時間 ------------------
# 11分

# -------------- 解説 / 感想 / 反省 -------------
#  https://www.slideshare.net/chokudai/abc006
# 工夫も何もいらない

# ----------------- カテゴリ ------------------
#AtCoder #abc
#全探索
