# ABC090C - Flip,Flip, and Flip
# URL: https://atcoder.jp/contests/arc091/tasks/arc091_a
# 日付: 2020/12/07

# ---------- 思ったこと / 気づいたこと ----------
# 自分のマス含めて周りの9マスのうちカードがあるマスが偶数個なら最終的に自分は表になり，奇数個なら裏になる

# ------------------- 方針 --------------------
# 3つの場合分け
# n == 1 and m == 1
# n == 1 or m == 1
# n >= 3 and m >= 3

# ------------------- 解答 --------------------
#code:python
n, m = map(int, input().split())

if n == 1 and m == 1:
    print(1)
elif n == 1 or m == 1:
    print(max(n, m)-2)
elif n >= 3 and m >= 3:
    print((n-2)*(m-2))
else:
    print(0)

# ------------------ 入力例 -------------------
2 2

1 7

314 1592
# ----------------- 解答時間 ------------------
# 17分

# -------------- 解説 / 感想 / 反省 -------------
# https://img.atcoder.jp/arc091/editorial.pdf
# 解説どーーーーり！

# ----------------- カテゴリ ------------------
#AtCoder #abc
#偶奇に注目
