# ABC176-C: Step
# URL:
# 日付: 2020/11/18

# ---------- 思ったこと / 気づいたこと ----------
# 貪欲に解けば良さそう

# ------------------- 方針 --------------------
# 手前の人より自分が小さければ，手前の人との差の分だけ大きくなる
# O(N)で解ける

# ------------------- 解答 --------------------

n = int(input())
a = list(map(int, input().split()))
a = [0] + a

ans = 0
for i in range(1, n+1):
    if a[i-1] >= a[i]:
        sa = a[i-1] - a[i]
        a[i] += sa
        ans += sa
print(ans)

# ------------------ 入力例 -------------------
5
3 3 3 3 3


5
2 1 5 4 3

# ----------------- 解答時間 ------------------
# 7分でAC

# ---------------- 感想 / 反省 ----------------
# 「より高い」ではなく「以上」ということに気づかずにWA出した

# ----------------- カテゴリ ------------------
#AtCoder #abc-c
#貪欲法 #灰色



