# ABC161C - Replacing an integer
# URL: https://atcoder.jp/contests/abc161/tasks/abc161_c
# 日付: 2020/11/23

# ---------- 思ったこと / 気づいたこと ----------
#

# ------------------- 方針 --------------------
# n%kとabs(n%k-k)を比較して小さい方

# ------------------- 解答 --------------------
#code:python
n,k=map(int, input().split())
print(min(n%k, abs(n%k-k)))

# ------------------ 入力例 -------------------
2 6

1000000000000000000 1

# ----------------- 解答時間 ------------------
#

# -------------- 解説 / 感想 / 反省 -------------
#

# ----------------- カテゴリ ------------------
#AtCoder #abc
#
