# ABC185
# URL: https://atcoder.jp/contests/abc185/tasks/abc185_a
# 日付: 2020/12/13

# ---------- 思ったこと / 気づいたこと ----------
#

# ------------------- 方針 --------------------
#

# ------------------- 解答 --------------------
#code:python

a,b,c,d = map(int, input().split())
print(min(a,b,c,d))

5 3 7 11







# ------------------ 入力例 -------------------


# ----------------- 解答時間 ------------------
#

# -------------- 解説 / 感想 / 反省 -------------
#

# ----------------- カテゴリ ------------------
#AtCoder #abc
#解説AC #復習したい