# ABC185
# URL: https://atcoder.jp/contests/abc185/tasks/abc185_e
# 日付: 2020/12/13

# ---------- 思ったこと / 気づいたこと ----------
#

# ------------------- 方針 --------------------
#

# ------------------- 解答 --------------------
#code:python
n, m = map(int, input().split())
a = list(map(int, input().split()))
b = list(map(int, input().split()))





# ------------------ 入力例 -------------------
4 3
1 2 1 3
1 3 1


# ----------------- 解答時間 ------------------
#

# -------------- 解説 / 感想 / 反省 -------------
#

# ----------------- カテゴリ ------------------
#AtCoder #abc
#解説AC #復習したい