# Educational DP Contest:  - Frog 1
# URL: https://atcoder.jp/contests/dp/tasks/dp_b
# 日付: 2020/12/25

# ---------- 思ったこと / 気づいたこと ----------
# Frog 1の推移の部分をループに変える
# 足場のループがi，幅のループがj
# i-jが非負の場合のみ更新可能

# ------------------- 方針 --------------------
# もらうDP: dp[i]を「dp[i-j]+i-jからのコスト」で更新

# ------------------- 解答 --------------------
#code:python
n, k = map(int, input().split())
h = list(map(int, input().split()))

dp = [10**10]*(n)
dp[0] = 0

for i in range(1, n):
    for j in range(1, k+1):
        if i-j >= 0:
            dp[i] = min(dp[i], dp[i-j] + abs(h[i] - h[i-j]))
print(dp[n-1])


# ------------------ 入力例 -------------------
5 3
10 30 40 50 20

3 1
10 20 10

2 100
10 10

10 4
40 10 20 70 80 10 20 70 80 60

# ----------------- 解答時間 ------------------
# 8分

# -------------- 解説 / 感想 / 反省 -------------
# if i-j >= 0:がポイント！
# Frog 1からコピペしたから早かった

# ----------------- カテゴリ ------------------
#EDPC
#動的計画法
#DP