# ARC108-A :
# URL:
# 日付: 2020年11月21日

# ---------- 思ったこと / 気づいたこと ----------
# 解の公式

# ------------------- 方針 --------------------
#

# ------------------- 解答 --------------------
#code:python
from math import sqrt
s, p = map(int, input().split())
m_p = (s+sqrt(s**2-4*p))/2
m_m = (s-sqrt(s**2-4*p))/2

if m_p == int(m_p) or m_m == int(m_m):
    print('Yes')
else: print('No')


s, p = map(int, input().split())
for n in range(1, 10**6+1):
    if s > n and p % n == 0:
        if int(s-n) == int(p // n):
            print('Yes')
            exit()
            break
print('No')

# ------------------ 入力例 -------------------
3 2
1000000000000 1


# ----------------- 解答時間 ------------------
#

# -------------- 解説 / 感想 / 反省 -------------
#

# ----------------- カテゴリ ------------------
#AtCoder #arc
#知ってるアルゴリズムだった
#知らないアルゴリズムだった
#非自明な論証が含まれていた